Enums/ВидыРегламентныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыРегламентныхОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачислениеЗарплаты</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеРезерваОтпусков</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АмортизацияИИзносОС</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнаниеВНУЛизинговыхПлатежей</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АмортизацияНМАИсписаниеРасходовПоНИОКР</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеСтоимостиСпецодеждыИспецоснасткиВэксплуатации</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаВалютныхСредств</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСтоимостиНоменклатуры</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета97</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетТорговойНаценкиПоПроданнымТоварам</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНалогаНаИмущество</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетТранспортногоНалога</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетЗемельногоНалога</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетТорговогоСбора</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнаниеРасходовНаПриобретениеОСДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнаниеРасходовНаПриобретениеНМАДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсключениеНЗПИзСоставаМатериальныхРасходовДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеДопРасходовДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеТаможенныхПлатежейДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетДолейСписанияКосвенныхРасходов</Name>
					<Comment>2</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчетов20_23_25_26</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета44</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетРезервовПоСомнительнымДолгам</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключениеАвансовВПрочиеДоходыДляИП</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеРасходовПоВидамДеятельностиДляУСН</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеРасходовПоВидамДеятельностиДляИП</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеСтраховыхВзносовИП</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетРасходовУменьшающихОтдельныеНалоги</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбесценениеЗапасов</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчетов90_91</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеУбытковПрошлыхЛет</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНалогаНаПрибыль</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетОтложенногоНалога</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНалогаУСН</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетЕНВД</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНДФЛДляИП</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеформацияБаланса</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыРегламентныхОпераций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет группу обработки "Закрытие месяца", к которой относится регламентная операция.
// Группа определяет последовательность операций (вводит дополнительное ограничение на нее):
// как правило, нельзя выполнить операцию группы, если не выполнены все потребные операции предыдущих групп.
//
// Параметры:
//  ВидОперации - ПеречислениеСсылка.ВидыРегламентныхОпераций
// 
// Возвращаемое значение:
//  Число - номер группы, от 1 до 4.
//
Функция НомерГруппы(ВидОперации) Экспорт
	
	// Также номер группы следует указать в комментарии элемента перечисления,
	// чтобы легко можно было проверить корректность последовательности элементов перечисления.
	
	Если ВидОперации = РасчетДолейСписанияКосвенныхРасходов Тогда
		НомерГруппы = 2;
	ИначеЕсли ВидОперации = ЗакрытиеСчетов20_23_25_26 Тогда
		НомерГруппы = 3;
	ИначеЕсли ВидОперации = ЗакрытиеСчета44 Тогда
		НомерГруппы = 3;
	ИначеЕсли ВидОперации = РасчетРезервовПоСомнительнымДолгам Тогда
		НомерГруппы = 3;
	ИначеЕсли ВидОперации = НачислениеСтраховыхВзносовИП Тогда
		НомерГруппы = 3;
	ИначеЕсли ВидОперации = ВключениеАвансовВПрочиеДоходыДляИП Тогда
		НомерГруппы = 3;
	ИначеЕсли ВидОперации = РаспределениеРасходовПоВидамДеятельностиДляУСН Тогда
		НомерГруппы = 3;
	ИначеЕсли ВидОперации = РаспределениеРасходовПоВидамДеятельностиДляИП Тогда
		НомерГруппы = 3;
	ИначеЕсли ВидОперации = РасчетРасходовУменьшающихОтдельныеНалоги Тогда
		НомерГруппы = 3;
	ИначеЕсли ВидОперации = ОбесценениеЗапасов Тогда
		НомерГруппы = 3;
	ИначеЕсли ВидОперации = ЗакрытиеСчетов90_91 Тогда
		НомерГруппы = 4;
	ИначеЕсли ВидОперации = СписаниеУбытковПрошлыхЛет Тогда
		НомерГруппы = 4;
	ИначеЕсли ВидОперации = РасчетНалогаНаПрибыль Тогда
		НомерГруппы = 4;
	ИначеЕсли ВидОперации = РасчетОтложенногоНалога Тогда
		НомерГруппы = 4;
	ИначеЕсли ВидОперации = РасчетНалогаУСН Тогда
		НомерГруппы = 4;
	ИначеЕсли ВидОперации = РасчетЕНВД Тогда
		НомерГруппы = 4;
	ИначеЕсли ВидОперации = РеформацияБаланса Тогда
		НомерГруппы = 4;
	ИначеЕсли ВидОперации = РасчетНДФЛДляИП Тогда
		НомерГруппы = 4;
	Иначе
		НомерГруппы = 1;
	КонецЕсли;
	
	Возврат НомерГруппы;
	
КонецФункции

// Описывает перечень регламентных операций, для выполнения которых не используется документ РегламентнаяОперация
// - то есть, они выполняются иными, специальными документами.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВидыРегламентныхОпераций
//
Функция ВыполняютсяСпециальнымиДокументами() Экспорт
	
	Операции = Новый Массив;
	Операции.Добавить(НачислениеЗарплаты);
	Операции.Добавить(НачислениеРезерваОтпусков);
	Операции.Добавить(НачислениеНДС);
	Возврат Операции;
	
КонецФункции

// Описывает перечень регламентных операций, недоступных для использования в документе РегламентнаяОперация.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВидыРегламентныхОпераций
//
Функция НедоступныеРегламентныеОперации() Экспорт
	
	Операции = ВыполняютсяСпециальнымиДокументами();
	
	Если Не ПолучитьФункциональнуюОпцию("РасширенныйФункционал") Тогда
		Операции.Добавить(ОбесценениеЗапасов);
	КонецЕсли;
	
	Возврат Операции;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Не все регламентные операции допустимо выбирать в формах
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Исключения", НедоступныеРегламентныеОперации());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыРегламентныхОпераций.Ссылка КАК Значение,
	|	ПРЕДСТАВЛЕНИЕ(ВидыРегламентныхОпераций.Ссылка) КАК Представление,
	|	ВидыРегламентныхОпераций.Порядок КАК Порядок
	|ИЗ
	|	Перечисление.ВидыРегламентныхОпераций КАК ВидыРегламентныхОпераций
	|ГДЕ
	|	НЕ ВидыРегламентныхОпераций.Ссылка В (&Исключения)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Значение, Выборка.Представление);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
